{
    "english":
    {
        "title": "Long-term visa.",
        "description": "A long-term visa for France, also known as a \"visa de long séjour,\" is a type of visa that allows individuals to stay in France for an extended period beyond the typical short-term tourist visa duration.",
        "source": "https://www.service-public.fr/particuliers/vosdroits/F16162?lang=en",
        "steps":
        [
            {
                "title": "Determine the type of visa you need.",
                "type": "Information",
                "description": "Identify the category of long-term visa that suits your purpose of travel to France. This could include a work visa, student visa, family reunion visa, or other relevant visa category.",
                "question": "Do you know wich type of visa you need?",
                "source": "https://france-visas.gouv.fr/en/web/france-visas"
            },
            {
                "title": "Prepare the necessary documents",
                "type": "Document",
                "description": "You will need to get all those document for your visa application.",
                "question": "Do you already have all the necessary documents?",
                "source": "https://france-visas.gouv.fr/en/web/france-visas",
                "underQuestions":
                [
                    {
                        "title": "passport.",
                        "type": "Document",
                        "description": "You will need a valid passport, it must be valid for at least three months beyond your planned date of departure.",
                        "question": "Do you have a valid passport?",
                        "source": "https://en.wikipedia.org/wiki/Passport"
                    },
                    {
                        "title": "Visa application form.",
                        "type": "Document",
                        "description": "You will need to complete a visa application form. You can download the form from the website https://france-visas.gouv.fr/en/web/france-visas/forms.",
                        "question": "Do you have a complete visa application form?",
                        "source": "https://france-visas.gouv.fr/en/web/france-visas/forms"
                    },
                    {
                        "title": "Photos.",
                        "type": "Document",
                        "description": "You will need to provide two passport photos. The photos must be recent, in color, and measure 3.5 cm x 4.5 cm. The photos must be taken against a white background.",
                        "question": "Do you have two recent passport photos?",
                        "source": "https://france-visas.gouv.fr/en/web/france-visas/faq"
                    },
                    {
                        "title": "Proof of accommodation.",
                        "type": "Document",
                        "description": "You will need to provide proof of accommodation. This could include a hotel reservation, a rental agreement, or a letter of invitation from your host in France.",
                        "question": "Do you have proof of accommodation?",
                        "source": "https://france-visas.gouv.fr/en/web/france-visas/faq"
                    },
                    {
                        "title": "Proof of financial means.",
                        "type": "Document",
                        "description": "You will need to provide proof of financial means. This could include bank statements, pay slips, or other relevant documents.",
                        "question": "Do you have proof of financial means?",
                        "source": "https://france-visas.gouv.fr/en/web/france-visas/faq"
                    },
                    {
                        "title": "Proof of travel insurance.",
                        "type": "Document",
                        "description": "You will need to provide proof of travel insurance. The insurance must cover the entire duration of your stay in France.",
                        "question": "Do you have proof of travel insurance?",
                        "source": "https://france-visas.gouv.fr/en/web/france-visas/faq"
                    },
                    {
                        "title": "Purpose-specific documents.",
                        "type": "Document",
                        "description": "Work visa: Employment contract, letter from the employer, work permit, and proof of professional qualifications.\nStudent visa: Acceptance letter from a recognized educational institution, proof of payment of tuition fees, and academic transcripts.\nFamily reunion visa: Proof of family relationship, such as marriage or birth certificates, and a letter of invitation from the family member residing in France.",
                        "question": "Do you have purpose-specific documents? (Work visa, student visa, family reunion visa, or other relevant visa category)",
                        "source": "https://france-visas.gouv.fr/en/web/france-visas/faq"
                    }
                ]
            },
            {
                "title": "Schedule an appointment.",
                "type": "Appointment",
                "description": "You will need to submit your application in person at the French embassy or consulate in your country of residence. You will need to pay the visa fee when you submit your application. Remember to bring all the necessary documents with you to your appointment.",
                "question": "Have you submitted your application?",
                "source": "https://france-visas.gouv.fr/en/web/france-visas/lieu-de-residence?caller=depotVisas"
            },
            {
                "title": "Collect your visa.",
                "type": "Collect",
                "description": "You will need to collect your visa from the French embassy or consulate in your country of residence. You will need to present your passport and visa fee receipt when you collect your visa.",
                "question": "Have you collected your visa yet?",
                "source": "https://france-visas.gouv.fr/en/web/france-visas/track-your-application-status"
            }
        ]
    },
    "français":
    {
        "title": "Visa de long séjour.",
        "description": "Un visa de long séjour pour la France, également connu sous le nom de \"visa de long séjour\", est un type de visa qui permet aux personnes de séjourner en France pendant une période prolongée au-delà de la durée typique du visa touristique à court terme.",
        "source": "https://www.service-public.fr/particuliers/vosdroits/F16162?lang=en",
        "steps":
        [
            {
                "title": "Déterminez le type de visa dont vous avez besoin.",
                "type": "Information",
                "description": "Identifiez la catégorie de visa de long séjour qui correspond à votre objectif de voyage en France. Cela pourrait inclure un visa de travail, un visa d'étudiant, un visa de regroupement familial ou une autre catégorie de visa pertinente.",
                "question": "Savez-vous de quel type de visa vous avez besoin?",
                "source": "https://france-visas.gouv.fr/en/web/france-visas"
            },
            {
                "title": "Préparez les documents nécessaires.",
                "type": "Document",
                "description": "Vous devrez obtenir tous ces documents pour votre demande de visa.",
                "question": "Avez-vous déjà tous les documents nécessaires?",
                "source": "https://france-visas.gouv.fr/en/web/france-visas",
                "underQuestions":
                [
                    {
                        "title": "passeport.",
                        "type": "Document",
                        "description": "Vous aurez besoin d'un passeport valide, il doit être valide pendant au moins trois mois après la date de départ prévue.",
                        "question": "Avez-vous un passeport valide?",
                        "source": "https://en.wikipedia.org/wiki/Passport"
                    },
                    {
                        "title": "Formulaire de demande de visa.",
                        "type": "Document",
                        "description": "Vous devrez remplir un formulaire de demande de visa. Vous pouvez télécharger le formulaire sur le site Web https://france-visas.gouv.fr/en/web/france-visas/forms.",
                        "question": "Avez-vous un formulaire de demande de visa complet?",
                        "source": "https://france-visas.gouv.fr/en/web/france-visas/forms"
                    },
                    {
                        "title": "Photos.",
                        "type": "Document",
                        "description": "Vous devrez fournir deux photos d'identité. Les photos doivent être récentes, en couleur et mesurer 3,5 cm x 4,5 cm. Les photos doivent être prises sur un fond blanc.",
                        "question": "Avez-vous deux photos d'identité récentes?",
                        "source": "https://france-visas.gouv.fr/en/web/france-visas/faq"
                    },
                    {
                        "title": "Preuve d'hébergement.",
                        "type": "Document",
                        "description": "Vous devrez fournir une preuve d'hébergement. Cela pourrait inclure une réservation d'hôtel, un contrat de location ou une lettre d'invitation de votre hôte en France.",
                        "question": "Avez-vous une preuve d'hébergement?",
                        "source": "https://france-visas.gouv.fr/en/web/france-visas/faq"
                    },
                    {
                        "title": "Preuve de moyens financiers.",
                        "type": "Document",
                        "description": "Vous devrez fournir une preuve de moyens financiers. Cela pourrait inclure des relevés bancaires, des fiches de paie ou d'autres documents pertinents.",
                        "question": "Avez-vous une preuve de moyens financiers?",
                        "source": "https://france-visas.gouv.fr/en/web/france-visas/faq"
                    },
                    {
                        "title": "Preuve d'assurance voyage.",
                        "type": "Document",
                        "description": "Vous devrez fournir une preuve d'assurance voyage. L'assurance doit couvrir toute la durée de votre séjour en France.",
                        "question": "Avez-vous une preuve d'assurance voyage?",
                        "source": "https://france-visas.gouv.fr/en/web/france-visas/faq"
                    },
                    {
                        "title": "Documents spécifiques à l'objectif.",
                        "type": "Document",
                        "description": "Visa de travail: contrat de travail, lettre de l'employeur, permis de travail et preuve de qualifications professionnelles.\nVisa d'étudiant: lettre d'acceptation d'un établissement d'enseignement reconnu, preuve du paiement des frais de scolarité et relevés de notes.\nVisa de regroupement familial: preuve de la relation familiale, tels que les certificats de mariage ou de naissance, et une lettre d'invitation du membre de la famille résidant en France.",
                        "question": "Avez-vous des documents spécifiques à l'objectif? (Visa de travail, visa d'étudiant, visa de regroupement familial ou autre catégorie de visa pertinente)",
                        "source": "https://france-visas.gouv.fr/en/web/france-visas/faq"
                    }
                ]
            },
            {
                "title": "Prenez rendez-vous.",
                "type": "Rendez-vous",
                "description": "Vous devrez soumettre votre demande en personne à l'ambassade ou au consulat français de votre pays de résidence. Vous devrez payer les frais de visa lorsque vous soumettez votre demande. N'oubliez pas d'apporter tous les documents nécessaires avec vous à votre rendez-vous.",
                "question": "Avez-vous soumis votre demande?",
                "source": "https://france-visas.gouv.fr/en/web/france-visas/lieu-de-residence?caller=depotVisas"
            },
            {
                "title": "Récupérez votre visa.",
                "type": "Collecte",
                "description": "Vous devrez récupérer votre visa auprès de l'ambassade ou du consulat français de votre pays de résidence. Vous devrez présenter votre passeport et le reçu des frais de visa lorsque vous récupérerez votre visa.",
                "question": "Avez-vous déjà récupéré votre visa?",
                "source": "https://france-visas.gouv.fr/en/web/france-visas/track-your-application-status"
            }
        ]
    }
}